src/Catalogs/Оповещения/Оповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оповещения</name>
  <attributes>
    <name>ВключитьПоказателиВТекстОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИнтервалМеждуОповещениями</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалОЗакрытии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняющееЗадание</name>
    <type>
      <types>CatalogRef.ОчередьЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОтбораДляИнцидентов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныеШаблоныОЗакрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтноситсяКТипуИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещенияЗакрытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещенияСмс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещенияСмсЗакрытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаОповещенияЗакрытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПоказателей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодГруппировкиОповещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПовторногоОповещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоПочте</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоСМС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУведомлятьС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеУведомлятьПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРеакции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОповещатьНеактуальный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещатьЗакрыт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУведомлятьУдалять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоСкайпу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/СостоянияЗаданий/СостоянияЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаданий</name>
  <enumValues>
    <name>Запланировано</name>
    <comment>Задание запланировано на выполнение</comment>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
    <comment>Задание выполняется</comment>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
    <comment>Задание завершено</comment>
  </enumValues>
  <enumValues>
    <name>НеЗапланировано</name>
    <comment>Задание не запланировано</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаВыполнения</name>
    <comment>Ошибка при выполнении задания</comment>
  </enumValues>
  <enumValues>
    <name>НеАктивно</name>
    <comment>Задание не активно</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Оповещения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеБуфер = Новый РасписаниеРегламентногоЗадания;
	РасписаниеБуфер.ПериодПовтораДней = 1;
	РасписаниеБуфер.ПериодНедель = 1;
	РасписаниеБуфер.ПериодПовтораВТечениеДня = 20;
	РасписаниеПредставление = Строка(РасписаниеБуфер);
	
	Если ДополнительныеСвойства.Свойство("НеПроверять") Тогда
		Если ДополнительныеСвойства.НеПроверять Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Если ДополнительныеСвойства.Свойство("Программно") И ДополнительныеСвойства.Программно Тогда
		Если ДополнительныеСвойства.Свойство("Расписание") Тогда
			УстановитьРасписание(ДополнительныеСвойства.Расписание);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
		
	Если не ПроверитьКорректностьЗаполнения(Истина) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	
	//фильтр для ускорения выборки оповещений по инциденту (явно указываем отбор по типу в отдельное поле)
	
	ОтноситсяКТипуИнцидента = неопределено;
	
	Если НЕ ПустаяСтрока(НастройкиОтбораДляИнцидентов) Тогда
	
		КН = Новый КомпоновщикНастроекКомпоновкиДанных();
		
		Справочники.Оповещения.НастройкиОтбораДляИнцидентовДесериализация(КН, НастройкиОтбораДляИнцидентов);
		
		Если КН.Настройки.Отбор.Элементы.Количество() = 0 Тогда
			ВызватьИсключение "Не заполнены настройки отбора инцидентов для оповещения!";
		КонецЕсли;
			
		Для Каждого ЭлементОтбора из КН.Настройки.Отбор.Элементы Цикл
			Если
				ТипЗнч(ЭлементОтбора)=Тип("ЭлементОтбораКомпоновкиДанных") И
				Строка(ЭлементОтбора.ЛевоеЗначение)="ТипИнцидента" И
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно И
				ЭлементОтбора.Использование Тогда
				
				ОтноситсяКТипуИнцидента = ЭлементОтбора.ПравоеЗначение;
				Прервать;
			
			КонецЕсли;
		КонецЦикла;
	Иначе
		ВызватьИсключение "Не заполнены настройки отбора инцидентов для оповещения!";
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Расписание") Тогда
		УстановитьРасписание(ДополнительныеСвойства.Расписание);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ДополнительныеСвойства.Свойство("НеПроверять") Тогда
		Если ДополнительныеСвойства.НеПроверять Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
    
    Если ДополнительныеСвойства.Свойство("Использование") Тогда
        Если ЗначениеЗаполнено(ИсполняющееЗадание) Тогда
            ОчередьЗаданий.ИзменитьЗадание(ИсполняющееЗадание, Новый Структура("Использование", ДополнительныеСвойства.Использование));
        КонецЕсли;
    Иначе
        Если ЗначениеЗаполнено(ИсполняющееЗадание) Тогда
            ОчередьЗаданий.ИзменитьЗадание(ИсполняющееЗадание, Новый Структура("Использование", Ложь));
        КонецЕсли;
    КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьРасписание(Знач Расписание)
	
	Если Расписание = Неопределено Тогда
		Расписание = Новый РасписаниеРегламентногоЗадания;
		Расписание.ПериодПовтораДней = 1;
		Расписание.ПериодНедель = 1;
		Расписание.ПериодПовтораВТечениеДня = 20;
	КонецЕсли;
		
	Если ДополнительныеСвойства.Свойство("Использование") Тогда
		Использование = ДополнительныеСвойства.Использование;
	Иначе
		Использование = Ложь;
	КонецЕсли;
		
	Если Общий.СсылкаСуществует(ИсполняющееЗадание) Тогда
		Если ИсполняющееЗадание.СостояниеЗадания <> Перечисления.СостоянияЗаданий.НеАктивно Тогда
			Если Строка(ИсполняющееЗадание.Расписание.Получить()) <> Строка(Расписание) Тогда
				ОчередьЗаданий.ИзменитьЗадание(ИсполняющееЗадание, Новый Структура("Расписание, Использование", Расписание, Использование));
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПараметрыЗадания = Новый Массив;
		Если ЭтоНовый() Тогда
			СсылкаНового = Справочники.Оповещения.ПолучитьСсылку();
			УстановитьСсылкуНового(СсылкаНового);
			ПараметрыЗадания.Добавить(СсылкаНового);
		Иначе
			ПараметрыЗадания.Добавить(Ссылка);
		КонецЕсли;
					
		ПараметрыСоздания = Новый Структура;
		ПараметрыСоздания.Вставить("Использование",Использование);
		
		РасписаниеОчереди = Новый РасписаниеРегламентногоЗадания;
		РасписаниеОчереди.ПериодПовтораДней = 1;
		РасписаниеОчереди.ПериодПовтораВТечениеДня = 20;
		ПараметрыСоздания.Вставить("Расписание", РасписаниеОчереди);
		
		ПараметрыСоздания.Вставить("ИмяМетода", "Справочники.Оповещения.ВыполнитьПовторноеОповещение");
		ПараметрыСоздания.Вставить("Параметры", ПараметрыЗадания);
		Если ДополнительныеСвойства.Свойство("ЗапланированныйМоментЗапуска") Тогда
			ПараметрыСоздания.Вставить("ЗапланированныйМоментЗапуска", ДополнительныеСвойства.ЗапланированныйМоментЗапуска);
		КонецЕсли;
		ПараметрыСоздания.Вставить("Наименование", Наименование);
		ПараметрыСоздания.Вставить("НавигационнаяСсылкаВладельцаЗадания", ПолучитьНавигационнуюСсылку(ЭтотОбъект.ПолучитьСсылкуНового()));
				
		ИсполняющееЗадание = ОчередьЗаданий.ДобавитьЗадание(ПараметрыСоздания);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет корректность заполнения данных перед включением оповещения
//
// Параметры:
//  СообщатьОбОшибках - Булево - признак того, что нужно формировать сообщения о незаполненных полях
//
// Возвращаемое значение:
//  Булево
//
Функция ПроверитьКорректностьЗаполнения(Знач СообщатьОбОшибках) Экспорт
	
	Если ДополнительныеСвойства.Свойство("НеПроверять") Тогда
		НеПроверять = ДополнительныеСвойства.НеПроверять;
		Если НеПроверять Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
		
	Результат = Истина;
	Если ИсполняющееЗадание = Неопределено Тогда
		Если СообщатьОбОшибках Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "РасписаниеПредставление";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Текст = ЭтотОбъект.Наименование + ": Укажите расписание!";
			Сообщение.Сообщить();
		КонецЕсли;
		Результат = Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекстОповещения) И НЕ ВключитьПоказателиВТекстОповещения Тогда
		Если СообщатьОбОшибках Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "ТекстОповещения";
			Сообщение.Текст = ЭтотОбъект.Наименование + ": Укажите текст оповещения!";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
		Результат = Ложь;
	КонецЕсли;
	Если Получатели.Количество() = 0 Тогда
		Если СообщатьОбОшибках Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "Получатели";
			Сообщение.Текст = ЭтотОбъект.Наименование + ": Укажите хотя бы одного получателя!";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
		Результат = Ложь;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Процедура ПередУдалением(Отказ)
	Если Общий.СсылкаСуществует(ИсполняющееЗадание) Тогда
		ИсполняющееЗадание.ПолучитьОбъект().Удалить();
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
    
    ИсполняющееЗадание = Неопределено;
    
КонецПроцедуры

#КонецЕсли
